#+TITLE: Doc: Ssl Dynamic Graph

**** data processing

create reddit without feature columns.
#+BEGIN_SRC bash :dir /mnt/c/Users/terng/OneDrive/Documents/Working/tgn/data
xsv cat rows -n reddit_only_head_no_feature.csv reddit_no_header_features.csv > reddit_no_features.csv
#+END_SRC

#+RESULTS:

#+BEGIN_SRC bash :dir /mnt/c/Users/terng/OneDrive/Documents/Working/tgn/data
head reddit_no_features.csv
#+END_SRC

#+RESULTS:
| user_id | item_id | timestamp | state_label |
|       0 |       0 |       0.0 |           0 |
|       1 |       1 |      6.32 |           0 |
|       2 |       2 |     7.026 |           0 |
|       3 |       2 |    13.599 |           0 |
|       4 |       3 |    16.811 |           0 |
|       5 |       4 |    18.043 |           0 |
|       6 |       5 |     19.55 |           0 |
|       7 |       6 |    27.476 |           0 |
|       8 |       2 |     28.95 |           0 |

#+BEGIN_SRC bash :dir /mnt/c/Users/terng/OneDrive/Documents/Working/tgn/data
xsv cat rows -n reddit_only_head_no_feature.csv reddit_no_header_features.csv > reddit_no_features.csv

ls
#+END_SRC

#+RESULTS:
| ml_reddit.csv                   |
| ml_reddit.npy                   |
| ml_reddit_node.csv              |
| ml_reddit_node.npy              |
| reddit-modified-10000.csv       |
| reddit-modified.csv             |
| reddit.csv                      |
| reddit_10000.csv                |
| reddit_head.csv                 |
| reddit_no_features.csv          |
| reddit_no_header.csv            |
| reddit_no_header_features.csv   |
| reddit_only_head_no_feature.csv |
| tmp.csv                         |

#+BEGIN_SRC bash :dir /mnt/c/Users/terng/OneDrive/Documents/Working/tgn/data
xsv select 1 reddit_no_features.csv | xsv frequency | head
#+END_SRC

#+RESULTS:
| field   | value | count |
| user_id |   101 |  4690 |
| user_id |   554 |  4549 |
| user_id |   119 |  2918 |
| user_id |   150 |  2881 |
| user_id |   135 |  2632 |
| user_id |   529 |  2505 |
| user_id |   152 |  1786 |
| user_id |   576 |  1575 |
| user_id |   128 |  1563 |

#+BEGIN_SRC bash :dir /mnt/c/Users/terng/OneDrive/Documents/Working/tgn/data
xsv select 2 reddit_no_features.csv | xsv frequency | head
#+END_SRC

#+RESULTS:
| field   | value | count |
| item_id |     2 | 58727 |
| item_id |     6 | 52003 |
| item_id |    32 | 44706 |
| item_id |    31 | 32123 |
| item_id |    33 | 19027 |
| item_id |    38 | 13986 |
| item_id |    19 | 13627 |
| item_id |    72 | 12237 |
| item_id |    15 | 11752 |

#+BEGIN_SRC zsh dir: /mnt/c/Users/terng/OneDrive/Documents/Working/tgn/data
cmd dir
#+END_SRC

#+RESULTS:

#+BEGIN_SRC zsh dir: /mnt/c/Users/terng/OneDrive/Documents/Working/tgn/data
cmd dir
#+END_SRC

#+RESULTS:

#+BEGIN_SRC sh  dir: /mnt/c/Users/terng/OneDrive/Documents/Working/tgn/data
cmd dir
#+END_SRC

#+RESULTS:

